README.org
#+title: README

* Table of Contents
:PROPERTIES:
:TOC:      :include all :depth 5
:END:
:CONTENTS:
- [[#table-of-contents][Table of Contents]]
- [[#introduce][introduce]]
- [[#pdump][pdump]]
  - [[#dumpel][dump.el]]
  - [[#dump-entryel][dump-entry.el]]
  - [[#dumpsh][dump.sh]]
  - [[#lauch_dump_emacssh][lauch_dump_emacs.sh]]
  - [[#dump-initel][dump-init.el]]
- [[#具体配置][具体配置]]
  - [[#early-initel--在initel之前会执行的配置文件][early-init.el : 在init.el之前会执行的配置文件]]
  - [[#initel--入口配置-包含其他的配置文件][init.el : 入口配置, 包含其他的配置文件]]
  - [[#init-speedupel--加速启动配置-主要是-gc][init-speedup.el : 加速启动配置, 主要是 gc]]
  - [[#package-下载与安装][package 下载与安装]]
    - [[#init-packageel--自动安装-emacs-package][init-package.el : 自动安装 emacs package]]
    - [[#手动下载][手动下载]]
  - [[#init-imyel--个人定义的相关函数][init-imy.el : 个人定义的相关函数]]
  - [[#init-basicel--emacs-基础配置][init-basic.el : emacs 基础配置]]
  - [[#init-ivyel--ivy-相关的配置][init-ivy.el : ivy 相关的配置]]
  - [[#init-evilel--evil-相关的配置][init-evil.el : evil 相关的配置]]
  - [[#init-fontel--字体相关的配置][init-font.el : 字体相关的配置]]
  - [[#init-generalel--支持多leader-key的插件][init-general.el : 支持多leader key的插件]]
  - [[#init-mapel--定义快捷键的地方][init-map.el : 定义快捷键的地方]]
  - [[#init-roamel--org-roam][init-roam.el : org roam]]
  - [[#init-customel--将-custom-信息放在专门的文件里][init-custom.el : 将 custom 信息放在专门的文件里]]
  - [[#init-idle-time-loadel--利用idle-time-加载插件][init-idle-time-load.el : 利用idle time 加载插件]]
    - [[#init-evil-surroundel--类似-surroundvim][init-evil-surround.el : 类似 surround.vim]]
    - [[#init-agendael--agenda-相关][init-agenda.el : agenda 相关]]
    - [[#init-journalel--每日日记-journal-相关][init-journal.el : 每日日记 journal 相关]]
    - [[#init-captureel--capture-相关][init-capture.el : capture 相关]]
    - [[#init-yasnippetel--snippet][init-yasnippet.el : snippet]]
    - [[#init-pareditel--lisp-括号配对插件][init-paredit.el : lisp 括号配对插件]]
    - [[#init-org-downloadel--在-org-里插入图片][init-org-download.el : 在 org 里插入图片]]
    - [[#init-companyel--自动补全][init-company.el : 自动补全]]
    - [[#init-telegael--telegram-聊天][init-telega.el : telegram 聊天]]
    - [[#init-which-keyel--快捷键提示][init-which-key.el : 快捷键提示]]
    - [[#init-org-modeel--跟-org-mode-相关的配置][init-org-mode.el : 跟 org mode 相关的配置]]
    - [[#init-random-themeel--随机主题][init-random-theme.el : 随机主题]]
    - [[#init-foldel--折叠][init-fold.el : 折叠]]
    - [[#init-treemacsel--treemacs][init-treemacs.el : treemacs]]
    - [[#init-elfeedel--rss-reader][init-elfeed.el : rss reader]]
    - [[#init-nyan-modeel--用彩虹小猫显示当前buffer的光标进度][init-nyan-mode.el : 用彩虹小猫显示当前buffer的光标进度]]
    - [[#init-enable-modeel--想要默认开启的-minor-mode][init-enable-mode.el : 想要默认开启的 minor mode]]
    - [[#init-languageel--编程语言相关][init-language.el : 编程语言相关]]
      - [[#start][start]]
      - [[#python][python]]
      - [[#end][end]]
    - [[#init-windowel--window-窗口相关][init-window.el : window 窗口相关]]
- [[#tips-and-tricks][tips and tricks]]
  - [[#revert-buffer-不要提示-yesno][revert-buffer 不要提示 yes/no]]
  - [[#每-30s-保存一次所有buffer文件][每 30s 保存一次所有buffer文件]]
  - [[#org-babel-自动tangle][org babel 自动tangle]]
:END:
* introduce
旧的从零配置教程 :  [[file:configure-emacs-from-scratch.org][configure eamcs from scratch]]

2021-04-13 我开始使用 org babel, [[file:README.org][README.org]] 可以看作新的教程.

我的使用环境:
- 操作系统 : MacOS
- emacs 版本 : [[https://github.com/railwaycat/homebrew-emacsmacport][railwaycat/homebrew-emacsmacport: Emacs mac port formulae for the Homebrew package manager]] 

* pdump
** dump.el
dump file

#+begin_src emacs-lisp :tangle ./dump.el
;; dump.el -*- lexical-binding: t; -*-

(load (expand-file-name "early-init.el" user-emacs-directory))
(load (expand-file-name "dump-entry.el" user-emacs-directory))

(setq evil-want-keybinding nil) 

(require 'package)
(setq package-user-dir imy/package-install-dir)
(setq package-enable-at-startup nil)

;; load autoload files and populate load-path’s
(package-initialize)

(dolist (package package-list)
  (require package))

(setq luna-dumped-load-path load-path)

;; dump image
;; (dump-emacs-portable "~/.emacs.d/emacs.pdmp")
(dump-emacs-portable (expand-file-name "emacs.pdmp" user-emacs-directory))
#+end_src
** dump-entry.el

需要dump的配置, 借鉴 init.el 不断尝试调出一个能够dump的版本

#+begin_src emacs-lisp :tangle ./dump-entry.el
;; dump-entry.el -*- lexical-binding: t; -*-

(require 'init-imy)
(require 'init-package)
(require 'init-basic)
(require 'init-ivy)
(require 'init-evil)
(require 'init-font)
(require 'init-general) 
(require 'init-map)
(require 'init-roam)

(require 'unicode-fonts)
(unicode-fonts-setup)

(require 'expand-region)
(require 'init-evil-surround)
(require 'init-agenda)
(require 'init-journal)			      
(require 'init-capture)
(require 'init-snippet)
(require 'init-paredit)
(require 'init-org-download)
(require 'init-company)

(require 'init-language)
(require 'init-window)
(require 'init-telega)
(require 'init-which-key)
(require 'init-org-mode)
(require 'init-random-theme)
(require 'init-fold)

(require 'init-treemacs)
(require 'init-elfeed)
(require 'init-nyan-mode)
(require 'init-enable-mode)

(require 'init-custom)

(require 'init-hydra)
(require 'init-awesome-tab)
#+end_src
** dump.sh

shell脚本, 用来编译出 emacs.pdump

#+begin_src emacs-lisp :tangle ./dump.sh
emacs --batch -q -l ~/.emacs.d/dump.el 
#+end_src

** lauch_dump_emacs.sh

dump 方式打开 GUI 的 emacs

#+begin_src emacs-lisp :tangle ./lauch_dump_emacs.sh
open -a emacs --args --dump-file="/Users/fuhongxue/.emacs.d/emacs.pdmp" -l "~/.emacs.d/dump-init.el"
#+end_src

** dump-init.el

dump 启动文件, 与非 dump 的启动文件 init.el 分开

#+begin_src emacs-lisp :tangle ./dump-init.el
;; dump-init.el -*- lexical-binding: t; -*-

(setq load-path luna-dumped-load-path)

(global-font-lock-mode)
(transient-mark-mode)

(load "server")
(unless (server-running-p) (server-start))


;; 实现window的undo redo, 和 delete-other-windows 搭配使用
;; 不能dump, 出现错误 : unsupported object type in dump: window configuration
(winner-mode)

;; telega 
(set-fontset-font t 'unicode "Symbola" nil 'append)

;; Chinese Font
(if (display-graphic-p)
    (dolist (charset '(kana han symbol cjk-misc bopomofo))
      (set-fontset-font (frame-parameter nil 'font)
			charset
			(font-spec  :family imy/chinese-font :size imy/chinese-font-size))))

;; 解决terminal下 dump emacs evil esc 的异常 
(evil-mode 0)
(evil-mode 1)
#+end_src

* package 下载与安装

我没有使用其他包管理工具, 只使用 内置的 package 包, 如果从 package archives 的仓库源上下载不到, 我会通过手动下载(通常在 Github 上).

** init-package.el : 自动安装 emacs package 

#+begin_src emacs-lisp :tangle ./lisp/init-package.el
;; init-package.el -*- lexical-binding: t; -*-

(require 'package)
(setq package-user-dir imy/package-install-dir)
(setq package-enable-at-startup nil)
(setq package-archives '(("gnu" . "http://elpa.emacs-china.org/gnu/")
			 ("melpa" . "https://melpa.org/packages/")
			 ("melpa-stable" . "https://stable.melpa.org/packages/")
			 ("elpy" .  "http://jorgenschaefer.github.io/packages/")))

(package-initialize)

(setq package-list '(
		     command-log-mode  company writeroom-mode general visual-fill-column rainbow-identifiers yasnippet undo-fu org-bullets evil-nerd-commenter evil evil-collection magit projectile ivy org-roam org-roam-server grab-mac-link link-hint ripgrep counsel-projectile ivy-rich winum amx org-download rainbow-delimiters paredit which-key gcmh org-make-toc lsp-mode evil-surround ace-pinyin pinyinlib typescript-mode lsp-ui expand-region mood-line minions posframe rime org-journal unicode-fonts treemacs treemacs-evil treemacs-projectile ox-hugo elfeed elfeed-org org-super-agenda 

				       ;; kaolin-themes
				       doom-themes
				      
;; afternoon-theme  ample-theme leuven-theme plan9-theme twilight-bright-theme moe-theme flatui-theme  flucui-themes espresso-theme soft-stone-theme minimal-theme  darktooth-theme apropospriate-theme tao-theme   hc-zenburn-theme jazz-theme naquadah-theme  darkburn-theme  soothe-theme clues-theme  spacegray-theme planet-theme  seti-theme badwolf-theme darkmine-theme     gruber-darker-theme subatomic-theme  nimbus-theme  green-is-the-new-black-theme organic-green-theme green-phosphor-theme 
				      
				      ))

(unless package-archive-contents
  (package-refresh-contents))

(dolist (package package-list)
  (unless (package-installed-p package)
    (package-install package)))

(provide 'init-package)

#+end_src

** 手动下载

手动下载安装的一般步骤(以 nyan-mode 为例子):
1. 从 github 下载相关插件源码
2. 在 emacs 通过 load-path 倒入相关路径, 然后使用 package
   
    #+begin_src elisp
    (add-to-list 'load-path (concat imy/package-manual-dir "nyan-mode"))
    (require 'nyan-mode)
    #+end_src

* 具体配置
** early-init.el : 在init.el之前会执行的配置文件

#+begin_src emacs-lisp :tangle ./early-init.el
;;; early-init.el --- -*- lexical-binding: t -*-

(when (file-exists-p "~/private/") (load "~/private/sensitive.el")) 

;; proxy
(setq url-proxy-services
      `(
        ("http" . ,imy/proxy-url)
        ("https" . ,imy/proxy-url)
        ))

(setq user-init-file (or load-file-name (buffer-file-name)))
(setq user-emacs-directory (file-name-directory user-init-file))

(defvar imy/package-install-dir "~/.my-emacs-env/package-install/" "directory for package install")
(setq imy/backup-dir "~/.my-emacs-env/backup/")
(setq imy/autosave-dir "~/.my-emacs-env/autosave/")
(setq imy/package-manual-dir "~/.my-emacs-env/package-manual/")

(setq imy/lisp-dir (expand-file-name "lisp/" user-emacs-directory))
(add-to-list 'load-path imy/lisp-dir)

;; (setq package-enable-at-startup nil)

(setq site-run-file nil)

;;(menu-bar-mode -1)
(unless (and (display-graphic-p) (eq system-type 'darwin))
  (push '(menu-bar-lines . 0) default-frame-alist))
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)

(require 'init-speedup)

;; 去掉一些提示
(setq load-prefer-newer t)
(setq byte-compile-warnings '(cl-functions))


(provide 'early-init)
#+end_src

** init.el : 入口配置, 包含其他的配置文件
#+begin_src emacs-lisp :tangle ./init.el
;; init.el -*- lexical-binding: t; -*-

(require 'init-package)
(require 'init-imy)
(require 'init-basic)
(require 'init-ivy)
(require 'init-evil)
(require 'init-font)
(require 'init-general) 
(require 'init-map)
(require 'init-roam)
(require 'init-idle-time-load)
(require 'init-custom)

(require 'init-hydra)
(require 'init-awesome-tab)

;; (setq garbage-collection-messages t)
;; (setq gcmh-verbose t)

#+end_src
** init-speedup.el : 加速启动配置, 主要是 gc

#+begin_src emacs-lisp :tangle ./lisp/init-speedup.el
;; init-speedup.el -*- lexical-binding: t; -*-


(defvar better-gc-cons-threshold (* 16 1024 1024) ; 16mb
  "The default value to use for `gc-cons-threshold'.
If you experience freezing, decrease this. If you experience stuttering, increase this.")

(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)

(defvar startup/file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)

(defun startup/revert-file-name-handler-alist ()
  (setq file-name-handler-alist startup/file-name-handler-alist))

(defun startup/reset-gc ()
  (setq gc-cons-threshold better-gc-cons-threshold
	gc-cons-percentage 0.1))

(add-hook 'emacs-startup-hook 'startup/revert-file-name-handler-alist)
(add-hook 'emacs-startup-hook 'startup/reset-gc)

(defun gc-minibuffer-setup-hook ()
  (setq gc-cons-threshold (* better-gc-cons-threshold 2)))

(defun gc-minibuffer-exit-hook ()
  (garbage-collect)
  (setq gc-cons-threshold better-gc-cons-threshold))

(add-hook 'minibuffer-setup-hook #'gc-minibuffer-setup-hook)
(add-hook 'minibuffer-exit-hook #'gc-minibuffer-exit-hook)


(add-hook 'emacs-startup-hook
          (lambda ()
            (if (boundp 'after-focus-change-function)
                (add-function :after after-focus-change-function
                              (lambda ()
                                (unless (frame-focus-state)
                                  (garbage-collect))))
(add-hook 'after-focus-change-function 'garbage-collect))))



(add-hook 'emacs-startup-hook
          (lambda ()
            (message "Emacs ready in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))


(provide 'init-speedup)

#+end_src
