README.org
** init-ivy.el : ivy 相关的配置

#+begin_src emacs-lisp :tangle ./lisp/init-ivy.el
;; init-ivy.el -*- lexical-binding: t; -*-

(ivy-mode 1)
;;(setq ivy-use-virtual-buffers t) ;; 是否要将 bookmark 和 recentf 加入 ivy-swich-buffer.
(setq enable-recursive-minibuffers t)

;; delete M-x ^
;;(setq ivy-initial-inputs-alist nil)
(with-eval-after-load 'counsel
  (setq ivy-initial-inputs-alist nil))

(define-key ivy-minibuffer-map [escape] 'minibuffer-keyboard-quit)
;;(define-key ivy-minibuffer-map (kbd "<ESC>") 'minibuffer-keyboard-quit)
;;(define-key swiper-map (kbd "<ESC>") 'minibuffer-keyboard-quit)

;; 使用rg 替代 grep, 使用counsel-grep-or-swiper的时候
(setq counsel-grep-base-command
 "rg -i -M 120 --no-heading --line-number --color never '%s' %s")

 ;; ivy
(setq ivy-re-builders-alist
 '((counsel-rg . ivy--regex-plus)
  (swiper . ivy--regex-plus)
  (swiper-isearch . ivy--regex-plus)
  (t . ivy--regex-ignore-order))) ;; 忽略单词顺序

(setq counsel-find-file-ignore-regexp
        (concat
         ;; filename begins with #
         "\\(?:\\`[#.]\\)"
         ;; filename ends with # or ~
         "\\|\\(?:\\`.+?[#~]\\'\\)"
         "\\|\\.elc\\'"
         "\\|\\.pyc\\'"
         "\\|\\.meta\\'"
         ))


(custom-set-faces
 '(ivy-current-match
   ((((class color) (background light))
     :background "red" :foreground "white")
    (((class color) (background dark))
     :background "blue" :foreground "black"))))

;; 创建文件到时候能向上选择
(setq ivy-use-selectable-prompt t)



(provide 'init-ivy)

#+end_src
** init-evil.el : evil 相关的配置

#+begin_src emacs-lisp :tangle ./lisp/init-evil.el
;;; init-evil.el -*- lexical-binding: t; -*-

(setq evil-want-integration t) ;; This is optional since it's already set to t by default.
(setq evil-want-keybinding nil)

(require 'evil)
(evil-mode 1)


(when (require 'evil-collection nil t)
   (evil-collection-init))

;; (require 'evil-collection)
;; (evil-collection-init)


(require 'magit)
(evil-collection-magit-setup)

(setq-default evil-kill-on-visual-paste nil)

(provide 'init-evil)
#+end_src
** init-font.el : 字体相关的配置

#+begin_src emacs-lisp :tangle ./lisp/init-font.el

;; init-font.el -*- lexical-binding: t; -*-

;; midnight blue | dim gray | sea green | cornflower blue | gold
;; (set-face-background 'hl-line "cornflower blue")

;; (set-face-attribute 'region nil
;;                     :box '(:line-width -1 
;;                            ;; :color "gtk_selection_bg_color"
;;                            :color "gray14"
;;                            :style nil))


(setq imy/english-font "Fira Code")
(setq imy/chinese-font "PingFang SC")
;; (setq imy/english-font "Sarasa Mono SC Nerd")
;; (setq imy/chinese-font "Sarasa Mono SC Nerd")
(setq imy/english-font-height (* 15 10))
(setq imy/chinese-font-size 15)


;; Setting English Font  - Fira Code | Inconsolata | Monoid  + Unifont | Sarasa Mono SC Nerd |  PinFang SC | Source Code Pro | Monaco | menlo
(set-face-attribute 'default nil :height imy/english-font-height :weight 'regular :family imy/english-font)

;; Chinese Font 配制中文字体 PingFang SC | Songti SC
(if (display-graphic-p)
    (dolist (charset '(kana han symbol cjk-misc bopomofo))
      (set-fontset-font (frame-parameter nil 'font)
			charset
			(font-spec  :family imy/chinese-font :size imy/chinese-font-size))))

(provide 'init-font)
#+end_src
** init-general.el : 支持多leader key的插件

将插件包含进来, 真正定义快捷键文件上 init-map.el

#+begin_src emacs-lisp :tangle ./lisp/init-general.el

;;; init-general.el  -*- lexical-binding: t; -*-

(require 'general)

(provide 'init-general)
#+end_src
