README.org
** init-roam.el : org roam

#+begin_src emacs-lisp :tangle ./lisp/init-roam.el
;; init-roam.el -*- lexical-binding: t; -*-

(setq org-roam-buffer-width '0.25)

;; delete-other-windows 执行的时候  roam侧边栏也 delete
(setq org-roam-buffer-window-parameters nil) ;; (setq org-roam-buffer-window-parameters '((no-delete-other-windows . nil)))

;; roam find file 的时候不会自动打开 backlinks
(setq +org-roam-open-buffer-on-find-file nil)

(setq org-roam-directory "~/pkm-roam/roam0")  ;; roam 应用的文件夹
(setq org-roam-db-location "~/pkm-roam/org-roam.db")
(setq org-roam-completion-system 'ivy)

(defun start-roam-mode () (org-roam-mode t))
(add-hook 'after-init-hook 'start-roam-mode)

 (require 'org-roam-protocol)

 ;; 启动时无效, 关闭后再启动才有效

(setq org-roam-server-host "127.0.0.1"
        org-roam-server-port 1024
        org-roam-server-authenticate nil
        org-roam-server-export-inline-images t
        org-roam-server-serve-files nil
        org-roam-server-served-file-extensions '("pdf" "mp4" "ogv")
        org-roam-server-network-poll t
        org-roam-server-network-arrows nil
        org-roam-server-network-label-truncate t
        org-roam-server-network-label-truncate-length 60
        org-roam-server-network-label-wrap-length 20)


(setq org-roam-capture-ref-templates
      '(("r" "ref" plain (function org-roam-capture--get-point)
         ""
         :file-name "%<%Y%m%d%H%M%S>-${slug}"
         :head "#+title: ${title}\n#+roam_key: ${ref}\n#+ROAM_TAGS: webpage\n"
         :unnarrowed t)))


;; (setq org-roam-graph-extra-config '(
;;                                     ;; ("overlap" . "scale")
;;                                     ("rankdir" . "RL")
;;                                     ;; ("color" . "skyblue")
;;                                     ))

(provide 'init-roam)

#+end_src
** init-custom.el : 将 custom 信息放在专门的文件里

默认 emacs 会将一些 custom 信息放到 init.el 的末尾, 十分影响美观.

我将它抽出放入 custom.el
#+begin_src emacs-lisp :tangle ./lisp/init-custom.el
;; init-custom.el -*- lexical-binding: t; -*-

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(unless (file-exists-p custom-file)
  (write-region "" nil custom-file))
(when (file-exists-p custom-file)
  (load custom-file))

(provide 'init-custom)
#+end_src
** init-idle-time-load.el : 利用idle time 加载插件

为了提高 emacs 的启动速度, 我将一些不需要马上用到配置放到 idle time 再加载.

具体加载的时机是 idle time 超过 3s 的时候.

#+begin_src emacs-lisp :tangle ./lisp/init-idle-time-load.el
;; init-idle-time-load.el -*- lexical-binding: t; -*-

(defun imy/load-after-idle-time () 

  (load "server")
  (unless (server-running-p) (server-start))

  ;; (mac-auto-operator-composition-mode)

  ;; 解决unicode字体相关的问题, 尤其在telega有些图标名字显示不出来
  (require 'unicode-fonts)
  (unicode-fonts-setup)

  ;; 通过分析语义增量选择 region 的插件
  (require 'expand-region)

  (require 'init-evil-surround)
  (require 'init-agenda)
  (require 'init-journal)			      
  (require 'init-capture)
  (require 'init-snippet)
  (require 'init-paredit)
  (require 'init-org-download)
  (require 'init-company)

  (require 'init-telega)
  (require 'init-language)
  (require 'init-window)
  (require 'init-which-key)
  (require 'init-org-mode)
  (require 'init-random-theme)
  (require 'init-fold)
  ;; (require 'init-pinyin)

  (require 'init-treemacs)
  (require 'init-elfeed)
  (require 'init-nyan-mode)

  (require 'init-enable-mode)

  ;; dump 不了, 只能放在 idle 里
  (winner-mode)

  )

;; (imy/load-after-idle-time)

(setq  setup-idle-time-once
	   (run-with-idle-timer 3 t
				(lambda ()
				  (imy/load-after-idle-time)
				  (cancel-timer setup-idle-time-once)
				  )))



(provide 'init-idle-time-load)
#+end_src
*** init-evil-surround.el : 类似 surround.vim

#+begin_src emacs-lisp :tangle ./lisp/init-evil-surround.el
;; init-evil-surround.el -*- lexical-binding: t; -*-

(global-evil-surround-mode 1)

;; 自定义 ~ 的行为, 我在 ~ 前后多加了个空格
(setq-default evil-surround-pairs-alist
              (push '(?~ . (" ~" . "~ ")) evil-surround-pairs-alist))

(provide 'init-evil-surround)

#+end_src
*** init-agenda.el : agenda 相关

#+begin_src emacs-lisp :tangle ./lisp/init-agenda.el
;; init-agenda.el -*- lexical-binding: t; -*-

(setq org-agenda-files (list
			"~/pkm-roam/agenda/GTD.org"
			"~/pkm-roam/agenda/inbox.org"
			"~/pkm-roam/agenda/archive.org"
			))


 (setq org-todo-keywords
        '((sequence
           "☞ TODO(t)"  ; A task that needs doing & is ready to do
           "PROJ(p)"  ; An ongoing project that cannot be completed in one step
           "⚔ INPROCESS(i)"  ; A task that is in progress
           "⚑ WAITING(w)"  ; Something is holding up this task; or it is paused
           "|"
           "☟ NEXT(n)"
           ;; "✰ Important(i)"
           "✔ DONE(d)"  ; Task successfully completed
           "✘ CANCELED(c@)" ; Task was cancelled, aborted or is no longer applicable
	   ) 
          (sequence
           ;; "✍ NOTE(N)"
           ;; "FIXME(f)"
           "☕ BREAK(b)"
           ;; "❤ Love(l)"
           "REVIEW(r)"
           ))) ; Task was completed


(setq org-habit-graph-column 40) ;; agenda view 的时候宽带设定大一点

;; 如果设定了 org-agenda-files , 会在 org-agenda-files 列表里查找
(setq org-refile-targets
      '(("archive.org" :maxlevel . 1)
	("GTD.org" :maxlevel . 1)
	))

;; Save Org buffers after refiling!
(advice-add 'org-refile :after 'org-save-all-org-buffers)


;; Configure custom agenda views
(setq org-agenda-custom-commands
      '(
	;; ("d" "Dashboard"
	;;  ((agenda "" ((org-deadline-warning-days 7)))
	;;   (todo "☟ NEXT"
	;; 	((org-agenda-overriding-header "Next Tasks")))
	;;   ;; (tags-todo "agenda/⚔ INPROCESS" ((org-agenda-overriding-header "Active Projects")))
	;;   ))


	("d" "TODO"
	 ((todo "☞ TODO"
		((org-agenda-overriding-header "TODO Tasks")))))

	("i" "INPROCESS"
	 ((todo "⚔ INPROCESS"
		((org-agenda-overriding-header "Next Tasks")))))
	
	("n" "Next Tasks"
	 ((todo "☟ NEXT"
		((org-agenda-overriding-header "Next Tasks")))))

	))


(setq org-agenda-show-future-repeats 'next)
(setq org-agenda-repeating-timestamp-show-all nil)


(add-hook 'org-agenda-mode-hook (lambda ()
				  ;; (define-key org-agenda-mode-map "k" 'org-agenda-next-item)

(define-key org-agenda-mode-map "j" 'evil-next-line)
(define-key org-agenda-mode-map "k" 'evil-previous-line)

				  ))

(define-key global-map (kbd "C-c d")
  (lambda () (interactive) (org-agenda nil "d")))

(define-key global-map (kbd "C-c p")
  (lambda () (interactive) (org-agenda nil "i")))

(define-key global-map (kbd "C-c n")
  (lambda () (interactive) (org-agenda nil "n")))

(provide 'init-agenda)

#+end_src
*** init-journal.el : 每日日记 journal 相关
#+begin_src emacs-lisp :tangle ./lisp/init-journal.el

;; init-journal.el -*- lexical-binding: t; -*-

(require 'org-journal)

(setq org-journal-dir "~/pkm-roam/agenda/journal")
(setq org-journal-date-prefix "#+TITLE: ")
(setq org-journal-time-prefix "* ")
(setq org-journal-date-format "%Y-%m-%d, %A")
(setq org-journal-file-format "%Y-%m-%d.org")

(spc-leader-def 'normal 'override "j j" 'org-journal-new-entry)
(spc-leader-def 'normal 'override "j d" 'org-journal-new-date-entry)

(setq org-agenda-file-regexp "\\`\\\([^.].*\\.org\\\|[0-9]\\\{8\\\}\\\(\\.gpg\\\)?\\\)\\'")
(add-to-list 'org-agenda-files org-journal-dir)


;; capture
(defun org-journal-find-location ()
  ;; Open today's journal, but specify a non-nil prefix argument in order to
  ;; inhibit inserting the heading; org-capture will insert the heading.
  (org-journal-new-entry t)
  (unless (eq org-journal-file-type 'daily)
    (org-narrow-to-subtree))
  (goto-char (point-max)))


;; 关闭 journal 界面
(defun org-journal-save-entry-and-exit()
  "Simple convenience function.
  Saves the buffer of the current day's entry and kills the window
  Similar to org-capture like behavior"
  (interactive)
  (save-buffer)
  (kill-buffer-and-window))
(spc-leader-def 'normal 'override "j k" 'org-journal-save-entry-and-exit)

(provide 'init-journal)
#+end_src
