README.org
*** init-capture.el : capture 相关

主要用来存储 elfeed , 新闻等有启发意义的信息

#+begin_src emacs-lisp :tangle ./lisp/init-capture.el

;; init-capture.el -*- lexical-binding: t; -*-

;; (setq org-capture-templates '(("j" "Journal entry" plain (function org-journal-find-location)
;;                                "** %(format-time-string org-journal-time-format)%^{Title}\n%i%?"
;;                                :jump-to-captured t :immediate-finish t)))

(setq org-capture-templates
    `(

      ("t" "Tasks / Projects")
      ("ti" "Task" entry (file+olp "~/pkm-roam/agenda/inbox.org" "Inbox")
       "* %?\n  %U\n  %a\n  %i" :empty-lines 1)
      ("ts" "Task" entry (file+olp "~/pkm-roam/agenda/inbox.org" "resource")
       "* %?\n  %U\n  %a\n  %i" :empty-lines 1)


      
      ;; ("ts" "Clocked Entry Subtask" entry (clock)
      ;;  "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
      ;; ("h" "Inbox" entry (file "~/pkm-roam/agenda/inbox.org")
      ;;        "* %U %^{heading} %^g\n %?\n")
    
      ;; ("w" "Task" entry (file+olp "~/pkm-roam/agenda/inbox.org" "webpage")
      ;;  "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
    ))

(define-key global-map (kbd "C-c i")
  (lambda () (interactive) (org-capture nil "ti")))

(define-key global-map (kbd "C-c s")
  (lambda () (interactive) (org-capture nil "ts")))

(provide 'init-capture)

#+end_src
*** init-yasnippet.el : snippet


#+begin_src emacs-lisp :tangle ./lisp/init-snippet.el
;; init-snippet.el -*- lexical-binding: t; -*-

(require 'yasnippet)

(yas-global-mode 1)

(provide 'init-snippet)
#+end_src
*** init-paredit.el : lisp 括号配对插件

#+begin_src emacs-lisp :tangle ./lisp/init-paredit.el
;; init-paredit.el -*- lexical-binding: t; -*-

(autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
(add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
(add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
(add-hook 'ielm-mode-hook             #'enable-paredit-mode)
(add-hook 'lisp-mode-hook             #'enable-paredit-mode)
(add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
(add-hook 'scheme-mode-hook           #'enable-paredit-mode)

(provide 'init-paredit)

#+end_src
*** init-org-download.el : 在 org 里插入图片

#+begin_src emacs-lisp :tangle ./lisp/init-org-download.el
;;; init-org-download.el -*- lexical-binding: t; -*-

(require 'org-download)

(defun imy/im-file-name ()
  "copy buffer's full path to kill ring"
  (interactive)
  (when buffer-file-name
    ;; (file-name-nondirectory (kill-new (file-truename buffer-file-name)))))
     ;; (file-name-nondirectory  (file-truename buffer-file-name))))
     (file-name-sans-extension (buffer-name))))

(defun imy/org-download-paste-clipboard (&optional use-default-filename)
  (interactive "P")

  (yas-expand-snippet (yas-lookup-snippet "insert org image attr width"))

  (setq org-download-image-dir (concat "images/" (imy/im-file-name)))
  (let ((file
         (if (not use-default-filename)
             (read-string (format "Filename [%s]: " org-download-screenshot-basename)
                          nil nil org-download-screenshot-basename)
           nil)))
(org-download-clipboard file)))

(with-eval-after-load "org"
  (setq org-download-method 'directory)
  (setq org-download-image-dir  "images/")
  (setq org-download-heading-lvl nil)
  (setq org-download-timestamp "%Y%m%d-%H%M%S_")
  (setq org-image-actual-width nil)
  (setq org-src-window-setup 'split-window-right)
  (setq org-download-annotate-function (lambda (_link) ""))
  )


(provide 'init-org-download)

#+end_src
*** init-company.el : 自动补全

#+begin_src emacs-lisp :tangle ./lisp/init-company.el
;; init-company.el -*- lexical-binding: t; -*-

;; (with-eval-after-load 'company

;; 优化性能
(setq company-minimum-prefix-length 1
      company-idle-delay 0.5) ;; default is 0.2

(setq company-auto-complete t)
(setq company-show-numbers t)
;; )

(provide 'init-company)

#+end_src
*** init-telega.el : telegram 聊天

#+begin_src emacs-lisp :tangle ./lisp/init-telega.el
;; init-telega.el -*- lexical-binding: t; -*-


(add-to-list 'load-path (concat imy/package-manual-dir "telega.el"))

(require 'telega)
(with-eval-after-load 'telega
  (define-key telega-msg-button-map "k" nil)
  )

(setq telega-animation-play-inline nil)

(setq telega-chat-show-avatars nil)
;;(setq telega-avatar-text-compose-chars nil)

(add-hook 'telega-root-mode-hook (lambda () (writeroom-mode nil)))

(setq telega-proxies
      (list
       `(:server ,imy/telega-server-ip :port ,imy/telega-server-port :enable t
                 :type (:@type "proxyTypeHttp"
                               :username ,imy/telega-server-username :password ,imy/telega-server-password ))
       ))


(defun my-telega-chat-mode ()
  (set (make-local-variable 'company-backends)
       (append (list telega-emoji-company-backend
                   'telega-company-username
                   'telega-company-hashtag)
             (when (telega-chat-bot-p telega-chatbuf--chat)
               '(telega-company-botcmd))))
  (company-mode 1)
  (writeroom-mode 1))

(add-hook 'telega-chat-mode-hook 'my-telega-chat-mode)


(set-fontset-font t 'unicode "Symbola" nil 'append)

(setq telega-symbol-unread "🄌")
;; (setq telega-symbol-reply "↫")                                        

(defun my-telega-load ()
  ;; 🄌 occupies two full chars, but (string-width "🄌") returns 1
  ;; so we install custom widths to `char-width-table'
  (telega-symbol-set-width telega-symbol-unread 2)

  ;; ... other code
  )

(add-hook 'telega-load-hook 'my-telega-load)

(provide 'init-telega)

#+end_src
*** init-which-key.el : 快捷键提示

我设置按 C-h 才显示 
#+begin_src emacs-lisp :tangle ./lisp/init-which-key.el
;; init-which-key.el -*- lexical-binding: t; -*-

(setq which-key-show-early-on-C-h t)
(setq which-key-idle-delay 10000)
(setq which-key-idle-secondary-delay 0.05)

(setq which-key-prefix-prefix "+" )

(setq which-key-add-column-padding 2)

(which-key-mode)

;; (set-face-attribute 'which-key-key-face	nil :font "Hack Nerd Font Mono 14")
;; (set-face-attribute 'which-key-separator-face nil :font "Hack Nerd Font Mono 14")
;; (set-face-attribute 'which-key-note-face nil :font "Hack Nerd Font Mono 14")
;; (set-face-attribute 'which-key-special-key-face nil :font "Hack Nerd Font Mono 14")
;; (set-face-attribute 'which-key-group-description-face nil :font "Hack Nerd Font Mono 14")
;; (set-face-attribute 'which-key-command-description-face nil :font "Hack Nerd Font Mono 14")
;; (set-face-attribute 'which-key-local-map-description-face nil :font "Hack Nerd Font Mono 14")

(setq which-key-special-keys '("SPC" "TAB" "RET" "ESC" "DEL"))

(which-key-add-key-based-replacements
  "SPC b" "buffer"
  "SPC c" "close or hide"
  "SPC m" "bookmark"
  "SPC o" "open"
  "SPC s" "search"
  "SPC t" "toggle"
  "SPC w" "window"
  "SPC f" "frame"
  "SPC h" "help"
)

(provide 'init-which-key)

#+end_src
*** init-org-mode.el : 跟 org mode 相关的配置

#+begin_src emacs-lisp :tangle ./lisp/init-org-mode.el
;; init-org-mode.el -*- lexical-binding: t; -*-

;; 截图黏贴到 org 文件里
(require 'grab-mac-link)
(setq grab-mac-link-dwim-favourite-app 'chrome)


(setq org-src-preserve-indentation nil ;; 代码永久地保存固定不缩进
      org-edit-src-content-indentation 0) ;; 如果 org-src-preserve-indentation 为nil , 代码缩进值

(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))) 
(add-hook 'emacs-lisp-mode-hook
	  (lambda ()
	    (paredit-mode t)
	    (rainbow-delimiters-mode t)
	    (show-paren-mode 1)
	    ))

(add-hook 'lisp-interaction-mode
	  (lambda ()
	    (paredit-mode t)
	    (rainbow-delimiters-mode t)
	    (show-paren-mode 1)
	    ))

(add-hook 'after-change-major-mode-hook
	  (lambda ()
	    (modify-syntax-entry ?_ "w")))

(setq org-M-RET-may-split-line '((item . nil)))


(defun imy/org-global-prop( name )
  "Get the value from the global property with the given name, e.g. 'AUTHOR', 'TITLE', etc."
  (save-excursion
    (outline-show-all)
    (goto-line 0)
    (if (re-search-forward (concat "^#\\+" name ":") nil t)
	(progn
	  (setq start (point))
	  (re-search-forward "$")
	  (setq end (point))
	  (string-trim (buffer-substring-no-properties start end))))
    ))

(defun imy/org-mode-rename-buffer ()
  (interactive)
  (when (eq major-mode 'org-mode)
    (if (imy/org-global-prop "TITLE")
	(rename-buffer (imy/org-global-prop "TITLE")))))

(add-hook 'org-mode-hook  'imy/org-mode-rename-buffer)

(provide 'init-org-mode)

#+end_src
