README.org
*** init-random-theme.el : 随机主题

#+begin_src emacs-lisp :tangle ./lisp/init-random-theme.el
;; init-random-theme.el -*- lexical-binding: t; -*-

(load-theme 'doom-dracula t)

;; (add-to-list 'load-path (concat imy/package-manual-dir "theme"))
(add-to-list 'load-path (concat imy/package-manual-dir "rand-theme"))

(require 'rand-theme)

;; Themes I never want to be selected
(setq rand-theme-unwanted '(doom-nord-light tsdh-dark))

;; dark : kaolin-mono-dark kaolin-mono-light  darktooth

(setq wanted-theme '(
		       ;; dark
		       ;;  doom-snazzy doom-gruvbox  

		       ;; light
		       
		       ))

(setq rand-theme-wanted wanted-theme)


;; (rand-theme)


(provide 'init-random-theme)

#+end_src
*** init-fold.el : 折叠

#+begin_src emacs-lisp :tangle ./lisp/init-fold.el
;; init-fold.el -*- lexical-binding: t; -*-

;; Clean code folding via Outline minor mode.
(add-hook 'prog-mode-hook 'outline-minor-mode)
(add-hook 'text-mode-hook 'outline-minor-mode)

;; Show all headings but no content in Outline mode.
(add-hook 'outline-minor-mode-hook
	  (defun baba/outline-overview ()
	    "Show only outline headings."
	    (outline-show-all)
	    (outline-hide-body)))


(provide 'init-fold)

#+end_src
*** init-treemacs.el : treemacs

#+begin_src emacs-lisp :tangle ./lisp/init-treemacs.el
;; init-treemacs.el -*- lexical-binding: t; -*-
(require 'treemacs)
(require 'treemacs-evil)
(require 'treemacs-projectile)

(with-eval-after-load 'winum
  (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))

(treemacs-resize-icons 22)
(treemacs-follow-mode t)
(treemacs-filewatch-mode t)
(treemacs-fringe-indicator-mode 'always)

(pcase (cons (not (null (executable-find "git")))
	     (not (null treemacs-python-executable)))
  (`(t . t)
   (treemacs-git-mode 'deferred))
  (`(t . _)
   (treemacs-git-mode 'simple)))

(setq treemacs-collapse-dirs                 (if treemacs-python-executable 3 0)
      treemacs-deferred-git-apply-delay      0.5
      treemacs-directory-name-transformer    #'identity
      treemacs-display-in-side-window        t
      treemacs-eldoc-display                 t
      treemacs-file-event-delay              5000
      treemacs-file-extension-regex          treemacs-last-period-regex-value
      treemacs-file-follow-delay             0.2
      treemacs-file-name-transformer         #'identity
      treemacs-follow-after-init             t
      treemacs-git-command-pipe              ""
      treemacs-goto-tag-strategy             'refetch-index
      treemacs-indentation                   2
      treemacs-indentation-string            " "
      treemacs-is-never-other-window         nil
      treemacs-max-git-entries               5000
      treemacs-missing-project-action        'ask
      treemacs-move-forward-on-expand        nil
      treemacs-no-png-images                 nil
      treemacs-no-delete-other-windows       t
      treemacs-project-follow-cleanup        nil
      treemacs-persist-file                  (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
      treemacs-position                      'left
      treemacs-read-string-input             'from-child-frame
      treemacs-recenter-distance             0.1
      treemacs-recenter-after-file-follow    nil
      treemacs-recenter-after-tag-follow     nil
      treemacs-recenter-after-project-jump   'always
      treemacs-recenter-after-project-expand 'on-distance
      treemacs-show-cursor                   nil
      treemacs-show-hidden-files             t
      treemacs-silent-filewatch              nil
      treemacs-silent-refresh                nil
      treemacs-sorting                       'alphabetic-asc
      treemacs-space-between-root-nodes      t
      treemacs-tag-follow-cleanup            t
      treemacs-tag-follow-delay              1.5
      treemacs-user-mode-line-format         nil
      treemacs-user-header-line-format       nil
      treemacs-width                         35
      treemacs-workspace-switch-cleanup      nil)

(provide 'init-treemacs)

#+end_src
*** init-elfeed.el : rss reader

#+begin_src emacs-lisp :tangle ./lisp/init-elfeed.el
;; init-elfeed.el -*- lexical-binding: t; -*-


(require 'elfeed-org)
(elfeed-org)

(setq rmh-elfeed-org-files (list "~/pkm-roam/roam0/elfeed.org"))

(setq-default elfeed-search-filter "@1-months-ago +unread")

(add-hook 'elfeed-search-mode-hook 'elfeed-update)

(provide 'init-elfeed)

#+end_src
*** init-nyan-mode.el : 用彩虹小猫显示当前buffer的光标进度

#+begin_src emacs-lisp :tangle ./lisp/init-nyan-mode.el
;; init-nyan-mode.el -*- lexical-binding: t; -*-

(add-to-list 'load-path (concat imy/package-manual-dir "nyan-mode"))
(require 'nyan-mode)
(nyan-mode)

;; (add-to-list 'mode-line-format   '(:eval (list (nyan-create))))

(setq nyan-animation-frame-interval 2)
;; (setq nyan-wavy-trail nil)

(define-minor-mode mood-line-mode
  "Toggle mood-line on or off."
  :group 'mood-line
  :global t
  :lighter nil
  (if mood-line-mode
      (progn

        ;; Setup flycheck hooks
        (add-hook 'flycheck-status-changed-functions #'mood-line--update-flycheck-segment)
        (add-hook 'flycheck-mode-hook #'mood-line--update-flycheck-segment)

        ;; Setup VC hooks
        (add-hook 'find-file-hook #'mood-line--update-vc-segment)
        (add-hook 'after-save-hook #'mood-line--update-vc-segment)
        (advice-add #'vc-refresh-state :after #'mood-line--update-vc-segment)

        ;; Set the new mode-line-format
        (setq-default mode-line-format
                      '((:eval
                         (mood-line--format
                          ;; Left
                          (format-mode-line
                           '(" "
                             (:eval (mood-line-segment-modified))
                             (:eval (mood-line-segment-buffer-name))
                             (:eval (mood-line-segment-anzu))
			     (:eval (mood-line-segment-multiple-cursors))
			     (:eval (mood-line-segment-position))

			     (:eval (list (nyan-create)))
			     " "
			     )
			   )

			  
                          ;; Right
                          (format-mode-line
                           '((:eval (mood-line-segment-eol))
                             (:eval (mood-line-segment-encoding))
                             (:eval (mood-line-segment-vc))
                             (:eval (mood-line-segment-major-mode))
                             (:eval (mood-line-segment-misc-info))
                             (:eval (mood-line-segment-flycheck))
                             (:eval (mood-line-segment-flymake))
                             (:eval (mood-line-segment-process))
                             " ")))))))
    (progn

      ;; Remove flycheck hooks
      (remove-hook 'flycheck-status-changed-functions #'mood-line--update-flycheck-segment)
      (remove-hook 'flycheck-mode-hook #'mood-line--update-flycheck-segment)

      ;; Remove VC hooks
      (remove-hook 'file-find-hook #'mood-line--update-vc-segment)
      (remove-hook 'after-save-hook #'mood-line--update-vc-segment)
      (advice-remove #'vc-refresh-state #'mood-line--update-vc-segment)

      ;; Restore the original mode-line format
      (setq-default mode-line-format mood-line--default-mode-line))))

(provide 'init-nyan-mode)

#+end_src
*** init-enable-mode.el : 想要默认开启的 minor mode

放到 idle time 里加载

#+begin_src emacs-lisp :tangle ./lisp/init-enable-mode.el
;; init-enable-mode.el -*- lexical-binding: t; -*-

(recentf-mode 1)
(global-visual-line-mode)
(ivy-rich-mode)
(gcmh-mode 1)

(ace-pinyin-global-mode +1)

(provide 'init-enable-mode)

#+end_src
*** init-language.el : 编程语言相关
**** start
#+begin_src emacs-lisp :tangle ./lisp/init-language.el
;; init-language.el -*- lexical-binding: t; -*-

#+end_src
**** python

#+begin_src emacs-lisp :tangle ./lisp/init-language.el
;; 缩进调成 4, 默认是 2
(add-hook 'python-mode-hook
      (lambda ()
        (setq indent-tabs-mode t)
        (setq tab-width 4)
        (setq python-indent-offset 4)))
#+end_src
**** end

#+begin_src emacs-lisp :tangle ./lisp/init-language.el
(provide 'init-language)
#+end_src

*** init-window.el : window 窗口相关
#+begin_src emacs-lisp :tangle ./lisp/init-window.el
;; init-window.el.el -*- lexical-binding: t; -*-


;; 给window窗口标记数字, 使用 cmd + 12345 来跳转, 可和frame搭配
(require 'winum)
(winum-mode)

(provide 'init-window)
#+end_src
** init-hydra.el
#+begin_src emacs-lisp :tangle ./lisp/init-hydra.el
;; init-hydra.el -*- lexical-binding: t; -*-

(add-to-list 'load-path (concat imy/package-manual-dir "hydra"))
(require 'hydra)

(provide 'init-hydra)

#+end_src
