README.org
** init-awesome-tab.el

键位绑定使用了 hydra. 我正在试用 hydra 插件

M-0~9 : 按照数字切换 tab.

#+begin_src emacs-lisp :tangle ./lisp/init-awesome-tab.el

;; init-awesome-tab.el -*- lexical-binding: t; -*-
(add-to-list 'load-path (concat imy/package-manual-dir "awesome-tab"))

(require 'awesome-tab)

;; (awesome-tab-mode t)

(defhydra awesome-fast-switch (:hint nil)
  "
 ^^^^Fast Move             ^^^^Tab                    ^^Search            ^^Misc
-^^^^--------------------+-^^^^---------------------+-^^----------------+-^^---------------------------
   ^_k_^   prev group    | _C-a_^^     select first | _b_ search buffer | _C-k_   kill buffer
 _h_   _l_  switch tab   | _C-e_^^     select last  | _g_ search group  | _C-S-k_ kill others in group
   ^_j_^   next group    | _C-j_^^     ace jump     | ^^                | ^^
 ^^0 ~ 9^^ select window | _C-h_/_C-l_ move current | ^^                | ^^
-^^^^--------------------+-^^^^---------------------+-^^----------------+-^^---------------------------
"
  ("h" awesome-tab-backward-tab)
  ("j" awesome-tab-forward-group)
  ("k" awesome-tab-backward-group)
  ("l" awesome-tab-forward-tab)
  ("C-a" awesome-tab-select-beg-tab)
  ("C-e" awesome-tab-select-end-tab)
  ("C-j" awesome-tab-ace-jump)
  ("C-h" awesome-tab-move-current-tab-to-left)
  ("C-l" awesome-tab-move-current-tab-to-right)
  ("b" ivy-switch-buffer)
  ("g" awesome-tab-counsel-switch-group)
  ("C-k" kill-current-buffer)
  ("C-S-k" awesome-tab-kill-other-buffers-in-current-group)
  ("q" nil "quit"))

(spc-leader-def 'normal 'override "a h" 'awesome-fast-switch/body)

(global-set-key (kbd "M-1") 'awesome-tab-select-visible-tab)
(global-set-key (kbd "M-2") 'awesome-tab-select-visible-tab)
(global-set-key (kbd "M-3") 'awesome-tab-select-visible-tab)
(global-set-key (kbd "M-4") 'awesome-tab-select-visible-tab)
(global-set-key (kbd "M-5") 'awesome-tab-select-visible-tab)
(global-set-key (kbd "M-6") 'awesome-tab-select-visible-tab)
(global-set-key (kbd "M-7") 'awesome-tab-select-visible-tab)
(global-set-key (kbd "M-8") 'awesome-tab-select-visible-tab)
(global-set-key (kbd "M-9") 'awesome-tab-select-visible-tab)
(global-set-key (kbd "M-0") 'awesome-tab-select-visible-tab)

(provide 'init-awesome-tab)
#+end_src
* tips and tricks
** revert-buffer 不要提示 yes/no

[[https://emacs.stackexchange.com/questions/169/how-do-i-reload-a-file-in-a-buffer][How do I reload a file in a buffer? - Emacs Stack Exchange]]

方法1 : 
#+begin_src  elisp
(defun imy/revert-buffer-no-confirm ()
    "Revert buffer without confirmation."
    (interactive)
    (revert-buffer :ignore-auto :noconfirm))
#+end_src

方法2 : =auto-revert-mode=
** 每 30s 保存一次所有buffer文件

#+begin_src elisp
(setq  auto-save-buffer-idle-time
       (run-with-idle-timer 30 t
			    (lambda ()
			      ;;(message "auto save all buffer.")
			      (evil-write-all nil)
			      )))
#+end_src

** org babel 自动tangle

自动 tangle org babel 文件. 具体见 [[https://www.youtube.com/watch?v=kkqVTDbfYp4][Emacs From Scratch #7 - Configure Everything with Org Babel - YouTube]]

配置一多, 可能不想每次保存都自动生成, 可以使用  ~org-babel-tangle~  手动生成

#+begin_src elisp
(defun efs/org-babel-tangle-config ()
  (when (eq major-mode 'org-mode) 
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name user-emacs-directory))
        ;; Dynamic scoping to the rescue
        (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle)))))

(add-hook 'after-save-hook #'efs/org-babel-tangle-config)

#+end_src
